
Speaker 0: Learn English intensely learn English faster by

Speaker 1: practicing intense immersion. While it's fine to learn slowly sometimes, you can make tremendous progress by studying intensely for 1 month. Intensity focuses your brain and immerses it in English you'll learn more you'll remember more you'll speak better and you'll feel more confident if you study English intensely for 1 full month. Do this 3 to 5 times a year. How should you study intensely?

I recommend 4 or more hours a day of English study. You should divide this time over the entire day so for example listen 1 hour in the morning 1 hour during lunch, 1 hour going home from work, and 1 hour before sleep. Here's the plan I recommend. Number 1, listen to the lessons for 2 hours each day during your intensity month. Focus especially on the main audio articles and on the mini story and POV lessons.

These are the most powerful lessons and they are the most important. If you spend 2 hours every day focused on these lessons, your speaking and understanding will improve very quickly. Number 2, listen for 1 hour a day to a movie. Use my movie technique. Study only one scene for 3 to 7 days.

1st, use the subtitles to understand the vocabulary and meaning. Then, listen and use subtitles at the same time finally, turn off the subtitles and listen to the scene many times. And number 3, read an easy novel, 1 hour every day. I recommend children's novels to start with. Then you can gradually find more difficult books.

You should not need a dictionary to understand the book. If you need a dictionary, it's too difficult, so find an easier book. By following the above plan for 30 days or more, you will create a sudden, big, powerful improvement in your English ability. Your listening and speaking will show a huge improvement. Your vocabulary will grow quickly you'll feel more confident when you speak you don't always need to follow this plan but try to use it for just 30 days.

Do these intense study months every 2 or 3 months and you will get amazing results.